{
    "professionalskills": [
    {
        "tabTitle": "Toekomstgericht-organiseren",
        "cards": [
        {
            "title": "Deelgebied",
            "text": "Werkt onder algemene richtlijnen in een omgeving waar onvoorspelbare veranderingen plaatsvinden."
        },
        {
            "title": "Ethiek",
            "text": "Lost zelfstandig interactieve kwesties op die voortvloeien uit projectactiviteniten."
        },
        {
            "title": "Managen",
            "text": "Werkt onafhankelijk om interactieve problemen op te lossen. Heeft een positief eff ect op de teamprestaties."
        }
        ]
    },
    {
        "tabTitle": "Onderzoekend-Probleemoplossen",
        "cards": [
        {
            "title": "Probleemaanpak",
            "text": "Het identiﬁceren van het probleem, richting van de oplossing bepalen en een passende aa npak kiezen."
        },
        {
            "title": "Onderzoeken",
            "text": "Gedurende het hele oplosproces nieuwsgierig zijn en vragen stellen vanuit verschillende perspectieven, deze vragen met een passende aanpak pragmatisch, kritisch en gebaseerd op bronnen beantwoorden."
        },
        {
            "title": "Oplossen",
            "text": "Het zowel methodisch als creatief problemen op kunnen lossen, het vinden v an alternatieven en het kritisch de eigen en andermans redeneerketen kunnen doorlopen."
        }
        ]
    },
    {
        "tabTitle": "Persoonlijk-Leiderschap",
        "cards": [
        {
            "title": "Ondernemend zijn",
            "text": "Attent zijn, kansen zien en deze grijpen, zichzelf en anderen kunnen motiveren, zichzelf dan wel een team kunnen proﬁleren, anderen meenemen in de eigen ontwikkeling, leiderschap tonen en verantwoordelijkheid nemen."
        },
        {
            "title": "Persoonlijke ontwikkeling",
            "text": "Een overwogen studiekeuze maken, het eigen leervermogen versterken, een leerbehoefte bij zichzelf kunnen onderkennen en daarop passend acteren, reﬂecteren, evalueren, actief feedback vragen en geven."
        },
        {
            "title": "Persoonlijke Proﬁlering",
            "text": "Onderzoeken wat voor type professional men op termijn zou willen zijn, welk beroepenveld en type functies men ambieert en hoe zich daarin van anderen in de branche te onderscheiden."
        }
        ]
    },
    {
        "tabTitle": "Doelgericht-Interacteren",
        "cards": [
        {
            "title": "Partners",
            "text": "Aandacht voor de diverse groepen samenwerkingspartners zoals stakeholders, belangengroepen, eigen teamleden."
        },
        {
            "title": "Communiceren",
            "text": "Aandacht voor wat men wil communiceren met welke impact, de daarbij meest geschikte vorm en de daadwerkelijke uitvoering hiervan."
        },
        {
            "title": "Samenwerken",
            "text": "Aandacht voor de eigen rol in de context van de ICT - opdracht, taken herkennen en oppakken, anderen aanspreken, verrijking zoeken en vertrouwen opbouwen in een interdisciplinaire en interculturele context."
        }
        ]
    }],

    "beheersingniveaus": [
    {
        "tabTitle": "zelfstandigheid",
        "cards": [
        {
            "title": "Taakgericht",
            "text": "Werkt onder algemene richtlijnen in een omgeving waar onvoorspelbare veranderingen plaatsvinden."
        },
        {
            "title": "Probleemgericht",
            "text": "Lost zelfstandig interactieve kwesties op die voortvloeien uit projectactiviteniten."
        },
        {
            "title": "Situatiegericht",
            "text": "Werkt onafhankelijk om interactieve problemen op te lossen. Heeft een positief eff ect op de teamprestaties."
        },
        {
            "title": "Professiegericht",
            "text": "Coördineert en bestuurt. Stelt kwesties aan de orde met veel interacterende factoren."
        }
        ]
    },
    {
        "tabTitle": "complextiteit",
        "cards": [
        {
            "title": "Taakgericht",
            "text": "Gestructureerd voorspelbare context, probleem afgebakend, aanpak en oplossing bekend bij opdrachtgever."
        },
        {
            "title": "Probleemgericht",
            "text": "Gestructureerd - onvoorspelbare context, probleem gegeven, keuze aanpak en oplossingsruimte beperkt."
        },
        {
            "title": "Situatiegericht",
            "text": "Gestructureerd – onvoorspelbare context, vage problemen, aanpak en oplossingsruimte open."
        },
        {
            "title": "Professiegericht",
            "text": "Ongestructureerde multidisciplinaire en/of specialistische context."
        }
        ]
    }],

    "beroepstaken": [
    {
        "tabTitle": "hardware-analyseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Beschrijven van de architectuur van een computersysteem. \n Beschrijven van de werking van actuatoren en sensoren en metingen hieraan verrichten. \n Opstellen van (niet-)functionele eisen en acceptatiecriteria voor een computersysteem, bijv. een embedded of AI-systeem."
        },
        {
            "title": "Nivau 2",
            "text": "In kaart brengen van signalerings- en regelingsaspecten van de omgeving van een computersysteem bijvoorbeeld in een sensornetwerk. \n Methodisch specificeren van een computersysteem. \n Uitvoeren van een protocolanalyse. \n Opstellen van een acceptatietest voor een computersysteem."
        },
        {
            "title": "Niveau 3",
            "text": "Specificeren van een gedistribueerd computersysteem inclusief timing, resourcegebruik en performance. \n Beschrijven van security-aspecten van computersystemen die aan of via (openbare) netwerken gekoppeld zijn. \n Opstellen van een acceptatietestplan en een integratietestplan."
        },
        {
            "title": "Niveau 4",
            "text": "Onderzoek doen naar emerging technologies voor toepassing in gedistribueerde systemen. \n Onderzoek doen naar security aspecten binnen emerging technologies."
        }
        ]
    },
    {
        "tabTitle": "hardware-adviseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Verifiëren en onderbouwen van een gegeven technisch advies. Verifiëren en beschrijven van de initiële architectuur en de functionaliteit van een gegeven systeemconfiguratie (microprocessor, geheugen of andere bouwstenen)."
        },
        {
            "title": "Niveau 2",
            "text": "Uitbrengen van een technisch advies voor de architectuur van een computersysteem en de hardware- en software-componenten. \n Adviseren over het koppelen van systemen"
        },
        {
            "title": "Niveau 3",
            "text": "Uitbrengen van een technisch advies over een te realiseren (gedistribueerd) computersysteem, inclusief hardware- en software-componenten en koppelingen."
        },
        {
            "title": "Niveau 4",
            "text": "Uitbrengen van een technisch advies over de toepassing van emerging technologies om een gedistribueerde computersysteem te realiseren. \n Adviseren over toekomstgerichte inrichting van gedistribueerde computersystemen. \n Definiëren van visie op technologieroadmap en deze afstemmen met key stakeholders"
        }
        ]
    },
    {
        "tabTitle": "hardware-ontwerpen",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Ontwerpen van een eenvoudig computersysteem, bijv. een embedded of industriële automatiseringssysteem, op basis van gegeven hardware."
        },
        {
            "title": "Niveau 2",
            "text": "Ontwerpen van een computersysteem methodisch o.b.v. requirements met zelfgekozen hardware- en softwarecomponenten. \n- opstellen van een applicatie-driverontwerp opstellen. \n- ontwerpen van een protocol."
        },
        {
            "title": "Niveau 3",
            "text": "Ontwerpen van een gedistribueerd computersysteem inclusief bepaling van actuatoren, sensoren, timing, resourcegebruik en performance"
        },
        {
            "title": "Niveau 4",
            "text": "Ontwerpen van gedistribueerde computersystemen met gebruik van hardware synthese en/of artificial intelligence."
        }
        ]
    },
    {
        "tabTitle": "hardware-realiseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Software schrijven voor een eenvoudig, gegeven computersysteem, voorzien van actuatoren en sensoren."
        },
        {
            "title": "Niveau 2",
            "text": "Inrichten van een eenvoudig computersysteem en via software de koppelingen met hardwarecomponenten realiseren. \n Schrijven en testen van applicatiedriver-software. \n Implementeren en testen van een protocol."
        },
        {
            "title": "Niveau 3",
            "text": "Realiseren van een compleet computersysteem inclusief netwerk, hardware en systeemsoftware. \n Opstellen en uitvoeren van een acceptatieprocedure bijv. in een virtuele omgeving, inclusief aspecten als timing, resourcegebruik en performance."
        },
        {
            "title": "Niveau 4",
            "text": "Realiseren van een compleet computersysteem waarbij gebruik gemaakt wordt van hardware synthese (vhdl) of artificial intelligence."
        }
        ]
    },
    {
        "tabTitle": "hardware-manage",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Inrichten van een ontwikkel- en testplatform middels co-design ten behoeve van hardware/software, inclusief tools"
        },
        {
            "title": "Niveau 2",
            "text": "Beoordelen van een gegeven ontwikkelomgeving op kwaliteit en prestaties. \n Inrichten van een beheer- en testomgeving voor een computersysteem."
        },
        {
            "title": "Niveau 3",
            "text": "Opzetten en gebruikmaken van: \n- versiebeheer, \n- releasemanagement, \n- teamworkondersteuning, \n- automated testing voor hard- en softwaresystemen."
        },
        {
            "title": "Niveau 4",
            "text": "Aansturen van co-design teams voor het beheren van het realisatieproces van de hardware, software en synthese, inclusief de ontwikkelomgeving."
        }
        ]
    },
    {
        "tabTitle": "software-analyseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Verzamelen en valideren van functionele eisen voor een softwaresysteem met één belanghebbende volgens een standaardmethode. \n Definiëren van acceptatiecriteria voor bovengenoemde functionele eisen."
        },
        {
            "title": "Niveau 2",
            "text": "Uitvoeren van een requirementsanalyse voor een softwaresysteem met verschillende belanghebbenden, rekening houdend met de kwaliteitseigenschappen waaronder security. \n Uitvoeren van een analyse om functionaliteit, veiligheid, ontwerp, interfaces e.d. van een bestaand systeem of bestaande component te formuleren en te valideren. \n Opstellen van een acceptatietest aan de hand van kwaliteits-eigenschappen"
        },
        {
            "title": "Niveau 3",
            "text": "Uitvoeren van een requirementsanalyse voor een softwaresysteem met verschillende belanghebbenden in een context van bestaande systemen. \n Definiëren van acceptatiecriteria aan de hand van kwaliteitseigenschappen en een uitgevoerde risicoanalyse met onder andere aandacht voor security aspecten."
        },
        {
            "title": "Niveau 4",
            "text": "Analyse uitvoeren voor complexe software-in-software systemen (system in systems), inclusief alle niet-functionele requirements, waaronder safety, security en privacy."
        }
        ]
    },
    {
        "tabTitle": "software-adviseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Aanbevelingen doen over specifieke requirements van een softwaresysteem op grond van onderzoek naar bestaande, vergelijkbare systemen. Aanbevelingen doen over specifieke requirements van een softwaresysteem op grond van onderzoek naar bestaande, vergelijkbare systemen."
        },
        {
            "title": "Niveau 2",
            "text": "Adviseren over aanschaf en selectie van software-componenten bij het ontwikkelen van een softwaresysteem waarbij het kostenaspect een rol kan spelen. \n Adviseren over een onderdeel van een architectuur of een beperkt softwaresysteem. \nAdviseren over het gebruik van prototypes bij het valideren van de eisen."
        },
        {
            "title": "Niveau 3",
            "text": "Adviseren met betrekking tot de keuze voor softwarearchitectuur of bestaande software frameworks, waarbij kostenaspecten en kwaliteitskenmerken zoals beschikbaarheid, performance, security en schaalbaarheid een rol spelen. \n Adviseren over de aanpak bij het verwerken en raadplegen van grote hoeveelheden data met aandacht voor privacy. \n Adviseren over de inrichting van een softwareontwikkelproces, waaronder het testproces."
        },
        {
            "title": "Niveau 4",
            "text": "Definiëren van een visie ten aanzien van toekomstige technologie en software-architectuur in afstemming met stakeholders"
        }
        ]
    },
    {
        "tabTitle": "software-ontwerpen",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Maken van een ontwerp voor een softwaresysteem, inclusief database, met modelleertechnieken volgens een standaardmethode."
        },
        {
            "title": "Niveau 2",
            "text": "Opstellen van een ontwerp voor een softwaresysteem, rekening houdend met het gebruik van bestaande componenten en libraries. \n Toepassen van ontwerp-kwaliteitscriteria, rekening houdend met securityaspecten en verschillende typen devices. \n Maken van een ontwerp voor een systeem dat grote hoeveelheden data kan verwerken en raadplegen. \n Vaststellen van de kwaliteit van het ontwerp, bijvoorbeeld door toetsing of prototyping, rekening houdend met de geformuleerde kwaliteitseigenschappen. \n Opstellen van testontwerpen volgens een gegeven teststrategie."
        },
        {
            "title": "Niveau 3",
            "text": "Opstellen van een softwarearchitectuur voor een softwaresysteem, opgebouwd uit bestaande en nieuwe systemen, rekening houdend met meerdere belanghebbenden en kwaliteitskenmerken, waaronder security en schaalbaarheid. \n Opstellen van teststrategie voor systeemtesten."
        },
        {
            "title": "Niveau 4",
            "text": "Ontwerpen van een systeem voor het oplossen van een generieke klasse van problemen. \n Ontwerpen van een framework."
        }
        ]
    },
    {
        "tabTitle": "software-realiseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Bouwen, testen en beschikbaar stellen van een eenvoudig softwaresysteem. Het opzetten, vullen en bevragen van een database maakt onderdeel uit van het softwaresysteem."
        },
        {
            "title": "Niveau 2",
            "text": "Bouwen en beschikbaar stellen van een softwaresysteem dat bestaat uit meerdere subsystemen, hierbij gebruikmakend van bestaande componenten. \n Integreren van softwarecomponenten in een bestaand systeem, waarbij o.a. de integriteit, veiligheid en systeemprestaties bewaakt worden. \n Uitvoeren van, monitoren van en rapporteren over unit-, integratie-, regressie-, en systeemtesten, met aandacht voor security-aspecten."
        },
        {
            "title": "Niveau 3",
            "text": "Bouwen en beschikbaar stellen van een schaalbaar softwaresysteem dat aansluit bij bestaande systemen, eventueel in de cloud, volgens de ontworpen architectuur met gebruik van bestaande frameworks. \n Toepassen van testautomatisering bij het uitvoeren van testen."
        },
        {
            "title": "Niveau 4",
            "text": "Coderen van algoritmisch complexe problemen. \n Bouwen van AI-gerelateerde software."
        }
        ]
    },
    {
        "tabTitle": "software-manage",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Inrichten en gebruik maken van beheersysteem ter ondersteuning van softwareontwikkeling in teamverband."
        },
        {
            "title": "Niveau 2",
            "text": "Beheren en gebruiken van een ontwikkelstraat ter ondersteuning van softwareontwikkeling in teams, waardoor onder andere continuous integration tot de mogelijkheden behoort. \n Toepassen van methoden en technieken om een software-ontwikkelproces te managen en de kwaliteit ervan te borgen."
        },
        {
            "title": "Niveau 3",
            "text": "Uitvoeren van configuratie-, change- en releasemanagement in afstemming met infrastructuur-management. \n Inrichten van een ontwikkelstraat met geautomatiseerde build en test infrastructuur."
        },
        {
            "title": "Niveau 4",
            "text": "Ontwerpen en realiseren van een ontwikkelstraat met geautomatiseerde build en test infrastructuur."
        }
        ]
    },
    {
        "tabTitle": "infrastructuur-analyseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Analyseren van een lokale/kleine infrastructuur volgens een standaardmethode en op basis van gegeven (niet-) functionele eisen."
        },
        {
            "title": "Niveau 2",
            "text": "Analyseren van de kwaliteit van een middelgrote infrastructuur en de daarop aanwezige services aan de hand van gangbare methoden en standaarden. \n Analyseren van aan infrastructuur gerelateerde incidenten, problemen en security-bedreigingen."
        },
        {
            "title": "Niveau 3",
            "text": "Analyseren van de trends op het gebied van infrastructuren en deze vertalen naar gewenste of benodigde ontwikkelingen in bedrijfsinfrastructuur. \n Uitvoeren van een requirements- impact- of gap- analyse voor een enterprise infrastructuur om (niet-) functionele eisen, behoeftes en/of tekortkomingen, in kaart te brengen."
        },
        {
            "title": "Niveau 4",
            "text": "Uitvoeren van een requirements-, impact- of gap- analyse voor een enterprise infrastructuur-architectuur om eisen, behoeftes en/of tekortkomingen, in kaart te brengen."
        }
        ]
    },
    {
        "tabTitle": "infrastructuur-adviseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Aanbevelingen doen over een opzet van, of aanpassingen aan, een lokale/kleine infrastructuur."
        },
        {
            "title": "Niveau 2",
            "text": "Adviseren over inrichting en beheer van een infrastructuur met onderbouwde keuzes vanuit (niet-) functionele eisen, en vanuit beschikbare technologie, beheermodellen en beheermethodes. \n Maatregelen voorstellen die de informatiebeveiliging van een infrastructuur van een MKB verbeterd."
        },
        {
            "title": "Niveau 3",
            "text": "Adviseren over componenten van een enterprise infrastructuur, inclusief beheer- , beveiliging- en privacy aspecten, in relatie tot informatie- en referentiearchitecturen, innovatie, maatschappelijke en internationale ontwikkelingen. \n Adviseren over de migratie naar, of keuze voor een public, private of hybride cloud."
        },
        {
            "title": "Niveau 4",
            "text": "Adviseren over de architectuur van een enterprise infrastructuur, inclusief beheer- , beveiliging- en privacy aspecten, in relatie tot informatie- en referentiearchitecturen, innovatie, maatschappelijke en internationale ontwikkelingen."
        }
        ]
    },
    {
        "tabTitle": "infrastructuur-ontwerpen",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Opstellen van specificaties voor een lokale/kleine infrastructuur volgens een standaardmethode."
        },
        {
            "title": "Niveau 2",
            "text": "Adviseren over de architectuur van een enterprise infrastructuur, inclusief beheer- , beveiliging- en privacy aspecten, in relatie tot informatie- en referentiearchitecturen, innovatie, maatschappelijke en internationale ontwikkelingen.Beschrijven van beheerprocessen en maken van afspraken omtrent te leveren diensten. \n Automatiseren van het beheer en de uitrol van een infrastructuur in een middelgrote omgeving. \n Opstellen van een technisch ontwerp voor een middelgrote infrastructuur met bijbehorende beveiliging op basis van (niet-) functionele eisen."
        },
        {
            "title": "Niveau 3",
            "text": "Ontwerpen van componenten van een enterprise infrastructuur met inachtneming van alle requirements, in een private, public of hybride cloudomgeving. \n Ontwerpen van een incident response organisatie (CSIRT) en systemen om adequaat te kunnen reageren op incidenten van iedere aard en omvang"
        },
        {
            "title": "Niveau 4",
            "text": "Ontwerpen van de enterprise infrastructuur met inachtneming van alle requirements, in een private, public of hybride cloudomgeving."
        }
        ]
    },
    {
        "tabTitle": "infrastructuur-realiseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Inrichten, testen en beschikbaar stellen van een lokale/kleine infrastructuur."
        },
        {
            "title": "Niveau 2",
            "text": "Inrichten van een middelgrote infrastructuur die voldoet aan gestelde eisen op gebied van performance, scalability, security en compliance. \n Opzetten van basismonitoring van de infrastructuur. \n Opstellen en uitvoeren van een testplan voor een middelgrote infrastructuur om de kwaliteit te toetsen op basis van het opgestelde (niet-) functionele ontwerp."
        },
        {
            "title": "Niveau 3",
            "text": "Realiseren van componenten van een enterprise infrastructuur met inachtneming van alle requirements en gebruikmakend van een public, private en/of een hybride cloud omgeving. \nOpzetten van componenten van een omgeving waarin de kwaliteit van een veilige dienstverlening centraal kan worden bewaakt. \n Opzetten en uitvoeren van een pilot-/migratietraject inclusief overdracht naar beheer."
        },
        {
            "title": "Niveau 4",
            "text": "Realiseren van een enterprise infrastructuur, of complexe aspecten of onderdelen hiervan, met inachtneming van alle requirements en gebruikmakend van een public, private en/of een hybride cloud omgeving. \n Opzetten van een omgeving waarin de kwaliteit van een veilige ICT-dienstverlening centraal kan worden bewaakt."
        }
        ]
    },
    {
        "tabTitle": "infrastructuur-manage",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Opzetten en documenteren van standaardbeheerprocessen en werkprocedures inclusief systeem- en netwerkconfiguratie, ten behoeve van het beheer van een lokale/kleine infrastructuur."
        },
        {
            "title": "Niveau 2",
            "text": "Onderbrengen van beheer van nieuwe technologische ontwikkelingen m.b.t. de infrastructuur. \n Implementeren van delen van beheerprocessen. \n Vastleggen van de specificaties van een beheeromgeving waarmee kwaliteit van de ICT-dienstverlening kan worden gemeten, waaronder het ontvangen en afhandelen van klantverzoeken, en te kunnen rapporteren over dienstenniveau."
        },
        {
            "title": "Niveau 3",
            "text": "Opzetten van beheerprocessen en uitvoeren van een public, hybride of private cloudgebaseerde infrastructuur. \n Vastleggen van de specificaties van een proactieve beheeromgeving van een public, hybride of private cloud infrastructuur."
        },
        {
            "title": "Niveau 4",
            "text": "Vormgeven van Business - IT alignment en IT governance in relatie tot een enterprise infrastructuur."
        }
        ]
    },
    {
        "tabTitle": "organisatie-analyseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Analyseren van een enkel organisatieproces, organisatie, gegevensstromen, databehoeften en procesbesturing op operationeel niveau. \nAnalyseren van knelpunten en oorzaak-gevolgrelaties vanuit de invalshoek van de informatievoorziening."
        },
        {
            "title": "Niveau 2",
            "text": "Analyseren van meerdere operationele en tactische organisatieprocessen en de kwaliteit van de huidige ICT-voorziening. \n Analyseren van samenhang van knelpunten en oorzaak-gevolgrelaties. \n Vaststellen van de ICT-requirements vanuit de behoefte van relevante stakeholders. \n Analyseren van beschikbare ICT-mogelijkheden in het veld."
        },
        {
            "title": "Niveau 3",
            "text": "Analyseren van de consequenties van een (strategische) koerswijziging voor organisatie processen en hun informatievoorziening. \n Analyseren (kwantitatief en/of kwalitatief) van de huidige en toekomstige situatie op het gebied van bijvoorbeeld beleid, strategie, alignment en architectuur, met gebruikmaking van gangbare methoden. \n Analyseren van de huidige acceptatie van nieuwe technologie en eventuele weerstanden. \n Analyseren van gestructureerde en ongestructureerde interne en externe data."
        },
        {
            "title": "Niveau 4",
            "text": "Uitvoeren van grondig theoretisch onderbouwd onderzoek naar technologische (interorganisationele) procesinnovaties (AI, machine & deep learning, digital twins, blockchain, etc.)."
        }
        ]
    },
    {
        "tabTitle": "organisatie-adviseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Adviseren van verbeteringen voor een enkel organisatieproces op het terrein van organisatie(structuur), processen en informatievoorziening, met inachtneming van de mogelijkheden van ICT."
        },
        {
            "title": "Niveau 2",
            "text": "Adviseren over oplossingen voor knelpunten op het terrein van organisatiestructuur (en rollen), (organisatie)processtructuur, samenhang en informatievoorziening. \n Adviseren over nieuwe ICT-mogelijkheden, waaronder pakketselectie en advies."
        },
        {
            "title": "Niveau 3",
            "text": "Adviseren over de interne en externe afstemming tussen business en ICT (alignment en governance) rekening houdend met de doelstellingen van de organisatie (o.a. missie, visies, strategie en KPI’s). \n Adviseren over een veranderkundige aanpak bij de invoering van nieuwe ICT-mogelijkheden. \n Adviseren in oplossingen voor gestructureerde en ongestructureerde data."
        },
        {
            "title": "Niveau 4",
            "text": "Adviseren van technologische (interorganisationele) proces innovaties, waarbij ook rekening wordt gehouden wordt met de sociale context (mens en organisatie). \n Creëren van breed draagvlak onder alle relevante stakeholders." 
        }
        ]
    },
    {
        "tabTitle": "organisatie-ontwerpen",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Ontwerpen van een enkel organisatieproces, enkele gegevensstromen, een organisatieonderdeel en/of een deel van de informatievoorziening."
        },
        {
            "title": "Niveau 2",
            "text": "Ontwerpen van samenhangende organisatieprocessen: een gegevensstructuur (model), het procesmanagement van organisatieprocessen, de functionele organisatiestructuur en/of de informatievoorziening, rekening houdend met security en privacy wetgeving. \n Ontwerpen van de inrichting van een standaardapplicatie. \n Ontwerpen van de interfaces voor een applicatie in het applicatielandschap (mappings)."
        },
        {
            "title": "Niveau 3",
            "text": "Ontwerpen van de architectuur van organisatieprocessen en besturingsmodellen, inclusief bijbehorende beheersing, informatievoorziening en veranderproces. \n Ontwerpen van een veranderkundige aanpak met bijbehorende interventies. \n Ontwerpen van oplossingen voor gestructureerde en ongestructureerde data."
        },
        {
            "title": "Niveau 4",
            "text": "Ontwerpen van technologische (interorganisationele) procesinnovaties. \nEvalueren en valideren van mogelijke procesinnovaties."
        }
        ]
    },
    {
        "tabTitle": "organisatie-realiseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Beschrijven en opstellen van werkinstructies, functie- en rolbeschrijvingen, en procedures voor een (aangepast) proces. \n Testen van de aansluiting van de organisatieprocessen met de opgeleverde informatievoorziening. \n Opstellen van een eenvoudig implementatieplan."
        },
        {
            "title": "Niveau 2",
            "text": "Realiseren van de invoering en acceptatie van procedures in samenhang met nieuwe of gewijzigde informatievoorziening en besturing \n Opleiden en trainen van eindgebruikers in de vernieuwde processen en gebruik van een nieuwe ICT. \nBouwen en valideren van een proof of concept. \n Inrichten van een standaardapplicatie (bv. CRM, ERP, BI)."
        },
        {
            "title": "Niveau 3",
            "text": "Realiseren van invoering en acceptatie van gewijzigde organisatieprocessen op basis van een implementatieplan. \nInrichten van oplossingen voor gestructureerde en ongestructureerde data."
        },
        {
            "title": "Niveau 4",
            "text": "Bouwen en valideren van prototypen van nieuwe technologische oplossingen voor (interorganisationele) procesinnovaties."
        }
        ]
    },
    {
        "tabTitle": "organisatie-manage",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Verrichten van onderhoudswerkzaamheden aan procesdocumentatie (bv. business rules, principes en procesmodellen). \n Beschrijven van de veranderbehoefte voor een enkel deelproces."
        },
        {
            "title": "Niveau 2",
            "text": "Inrichten, onderhouden en actualiseren van functionele beheerprocessen. \n Signaleren en inventariseren van de veranderbehoefte van meerdere operationele en tactische organisatieprocessen."
        },
        {
            "title": "Niveau 3",
            "text": "Richten en actualiseren van principes, business rules en modellen van procesarchitectuur. \n Proactief signaleren van behoefte aan verandering in alle organisatie processen en bijbehorende veranderprocessen in gang zetten."
        },
        {
            "title": "Niveau 4",
            "text": "Bedenken van nieuwe technologische oplossingen voor het beheren van (interorganisationele) procesinnovaties."
        }
        ]
    },
    {
        "tabTitle": "gebruikersinteractie-analyseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Identificeren van de kernelementen van een externe opdracht waarbij verduidelijking wordt gezocht bij opdrachtgever, gebruikers en deskundigen. \n Inventariseren van klant- en gebruikersbehoeften en deze vertalen naar IT-oplossingen. \n Oriënteren op bestaande interactieve concepten, diensten en producten."
        },
        {
            "title": "Niveau 2",
            "text": "Benchmarken van functionaliteit, user interaction en UX design ten behoeve van een opdracht die uitgevoerd wordt binnen een bedrijf. \n Analyseren van kernwaarden opdrachtgever, product of dienst, user needs en hoe die tot uiting komen in product of dienst. \n Evalueren van de projectvoortgang vanuit het perspectief van de gebruiker."
        },
        {
            "title": "Niveau 3",
            "text": "Analyseren van de gebruiker, gebruikersinteractie en -ervaring, zowel individueel (fysiek, psychologisch, persoonlijke karakteristieken) als in grotere maatschappelijke context (sociaal / cultureel / ethisch / technologisch). \n Analyseren van actuele en state of the art interactieve technologieën. \n Analyseren per iteratie van het effect van de eigen interventie op/in de UX."
        },
        {
            "title": "Niveau 4",
            "text": "Analyseren van maatschappelijke, domein- en/of branche specifieke trends & kansen en hierover op strategisch niveau communiceren aan de key stakeholders."
        }
        ]
    },
    {
        "tabTitle": "gebruikersinteractie-adviseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Adviseren over interactieontwerp passend bij opdracht, klant en gebruikersbehoeften en voorafgaande oriëntatie. <br> Aanbevelingen doen op basis van een gegeven usability-analyse voor het ontwerp van een interactief product, systeem of dienst."
        },
        {
            "title": "Niveau 2",
            "text": "Geven van een goed gemotiveerd concreet advies over de te gebruiken interactieve technieken en/of interactieconcepten. <br> Voorstellen doen over de realisatiekeuzes, zoals de te gebruiken technologieën, daarbij rekening houdend met gebruikers- en bedrijfscontext. <br> Adviseren over de doelstellingen van de huidige en volgende iteraties."
        },
        {
            "title": "Niveau 3",
            "text": "Vertalen van analyse naar strategische aanbevelingen (op korte, middellange en langere termijn) voor het ontwerpen of verbeteren of onderzoeken van een UX met inzet van interactieve middelen. Hierbij wordt ook een onderbouwd advies gedaan voor het meest geschikte ontwerpproces (bijvoorbeeld UCD). <br> Adviseren over de UX-interventie(s) in de huidige en volgende iteraties."
        },
        {
            "title": "Niveau 4",
            "text": "Extrapoleren van technologische en maatschappelijke trends en deze vertalen naar een advies voor het ontwerp en de strategische inzet van zinvolle en innovatieve interactieve diensten en producten. Dit advies beschrijft een visie op de gebruikerservaring en de relatie tussen gebruiker en product/dienst."
        }
        ]
    },
    {
        "tabTitle": "gebruikersinteractie-ontwerpen",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Vertalen van adviezen in een eenvoudige gebruikersinteractie met een standaard prototyping-techniek. <br> Ontwerpen van een (usability)test waarmee essentiële interactieproblemen geïdentificeerd kunnen worden. <br> Toepassen en uitvoeren van een gebruikelijk interactieontwerpproces, zoals user centered design."
        },
        {
            "title": "Niveau 2",
            "text": "Vertalen van adviezen in een ontwerp van gedetailleerde gebruikersinteractie met verschillende prototyping-technieken. <br> Ontwerpen van een usabilitytest waarmee de doelstellingen van de iteratie geëvalueerd worden."
        },
        {
            "title": "Niveau 3",
            "text": "Vertalen van het advies naar een concreet en gedetailleerd UX-ontwerp, passend bij de projectfasering, hierbij gebruik makend van een adequaat gemotiveerd ontwerpproces. <br> Ontwerpen van een test waarmee de doelstellingen vanuit gebruikersperspectief geëvalueerd wordt."
        },
        {
            "title": "Niveau 4",
            "text": "Ontwerpen van user experience rekening houdend met langetermijnstrategie en organisatiedoelstellingen van de opdrachtgever. Hierbij wordt geanticipeerd op relevante maatschappelijke trends en technologische ontwikkelingen."
        }
        ]
    },
    {
        "tabTitle": "gebruikersinteractie-realiseren",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Realiseren en kwalitatief testen van eenvoudige interactieve producten of diensten op basis van een interactieontwerp waarbij gebruik wordt gemaakt van gangbare tools, design guidelines en/of huisstijl."
        },
        {
            "title": "Niveau 2",
            "text": "Realiseren van het interactieontwerp met verschillende tools en technieken. <br> Uitvoeren van de usabilitytest in het veld of in een lab. <br> Bewaken van het interactie-ontwerp bij het gerealiseerde interactieve product of dienst."
        },
        {
            "title": "Niveau 3",
            "text": "Realiseren en testen van de UX van een interactief product, prototype, systeem of dienst op basis van het ontwerp met gebruikmaking van bij de projectfasering passende tools en technieken. <br> Bewaken van aansluiting UX-ontwerp en gerealiseerde product in een onvoorspelbare context."
        },
        {
            "title": "Niveau 4",
            "text": "Realiseren van toekomst-bestendige producten, diensten of prototypes op de volgende aspecten: <br>- Innovatief UX design <br>- Innovatieve technieken en opkomende standaarden. <br>Validatie met key stakeholders van visie en strategie."
        }
        ]
    },
    {
        "tabTitle": "gebruikersinteractie-manage",
        "cards": [
        {
            "title": "Niveau 1",
            "text": "Vastleggen van de belangrijkste beslissingen, resultaten en inzichten m.b.t. interactieontwerp in een iteratief proces."
        },
        {
            "title": "Niveau 2",
            "text": "Vastleggen van de vertrekpunten en opbrengsten m.b.t. gebruikersperspectief tussen de iteraties in een ontwerp- en ontwikkelproces, en hiermee en de verbinding tussen de iteraties inzichtelijk maken. <br> Gebruiken en correct toepassen van standaarden (design guidelines m.b.t. interactie ontwerp, protocollen en methoden) passend binnen bedrijfscontext."
        },
        {
            "title": "Niveau 3",
            "text": "Bewaken van de kernwaarden en UX van product/organisatie of dienst in iedere fase van het ontwikkel- en productieproces. <br> Communiceren met stakeholders en vastleggen van beslissingen gerelateerd aan kernwaarden en user experience design gedurende alle fases van het ontwikkelproces. <br> Verhogen van gebruikers-acceptatie middels documentatie, training en/of marketing en gemotiveerde keuze voor de juiste vorm hiervan."
        },
        {
            "title": "Niveau 4",
            "text": "Aansturen van een complex project vanuit UX-perspectief op strategisch niveau met inachtneming van korte en lange termijn, betrekken en overtuigen van stakeholders zowel formeel als informeel."
        }
        ]
    }]
}